CREATE DATABASE  IF NOT EXISTS `bookhunter_database` /*!40100 DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci */ /*!80016 DEFAULT ENCRYPTION='N' */;
USE `bookhunter_database`;
-- MySQL dump 10.13  Distrib 8.0.27, for Win64 (x86_64)
--
-- Host: localhost    Database: bookhunter_database
-- ------------------------------------------------------
-- Server version	8.0.27

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `books`
--

DROP TABLE IF EXISTS `books`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `books` (
  `book_code` int NOT NULL AUTO_INCREMENT,
  `book_name` varchar(60) NOT NULL,
  `book_genre` int NOT NULL,
  `book_author` int NOT NULL,
  `book_count_in_storage` int NOT NULL,
  `book_cost` int NOT NULL,
  `publishing_house` int NOT NULL,
  `age_restriction` int NOT NULL,
  `publishing_year` int NOT NULL,
  `pages_count` int NOT NULL,
  `book_circulation` int NOT NULL,
  `book_image_path` varchar(100) DEFAULT NULL,
  PRIMARY KEY (`book_code`),
  KEY `author_key_idx` (`book_author`),
  KEY `publishing_house_key_idx` (`publishing_house`),
  KEY `restriction_key_idx` (`age_restriction`),
  KEY `genre_key_idx` (`book_genre`),
  CONSTRAINT `author_key` FOREIGN KEY (`book_author`) REFERENCES `authors` (`author_code`),
  CONSTRAINT `genre_key` FOREIGN KEY (`book_genre`) REFERENCES `genres` (`genre_code`),
  CONSTRAINT `publishing_house_key` FOREIGN KEY (`publishing_house`) REFERENCES `publishing_houses` (`publishing_house_code`),
  CONSTRAINT `restriction_key` FOREIGN KEY (`age_restriction`) REFERENCES `age_restrictions` (`restriction_code`)
) ENGINE=InnoDB AUTO_INCREMENT=126 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `books`
--

LOCK TABLES `books` WRITE;
/*!40000 ALTER TABLE `books` DISABLE KEYS */;
INSERT INTO `books` VALUES (1,'Алиса в зазеркалье',8,26,592,155,0,0,1998,85,12000,'1.jpg'),(2,'Хоббит Толкин',15,16,100,211,6,2,2012,198,5000,'2.jpg'),(3,'Виноваты звезды',5,10,264,512,9,2,2019,258,11500,'3.jpg'),(4,'Денискины рассказы',9,0,175,376,4,1,2011,275,15000,'4.jpg'),(5,'Зажечь небеса',0,6,75,417,15,2,2016,167,7500,'5.jpg'),(6,'Букварь',6,7,400,292,13,0,2000,54,15000,'6.jpg'),(7,'Как научить ребенка читать',3,28,363,155,10,0,2008,127,3500,'7.jpg'),(8,'Один на льдине',11,22,185,562,2,1,1978,293,12300,'8.jpg'),(9,'Мертвец',2,1,93,298,14,3,2014,186,2700,'9.jpg'),(10,'Оригами',9,24,312,945,13,0,2003,127,4500,'10.jpg'),(11,'Подсознание может все!',2,7,682,428,5,1,2018,87,7000,'11.jpg'),(12,'Русские пословицы и поговорки в иллюстрациях',4,8,723,568,12,0,2000,228,3000,'12.jpg'),(13,'Война и мир',6,3,935,211,5,2,1999,907,5000,'13.jpg'),(14,'Ведьмак',5,7,56,816,7,2,2008,765,6000,'14.jpg'),(15,'Пелагия и черный монах',10,13,78,248,1,1,2001,472,7500,'15.jpg'),(16,'Сердце сумрака',8,15,764,350,7,2,2007,832,5000,'16.jpg'),(17,'НЕ НОЙ',10,6,257,594,3,2,2012,287,5800,'17.jpg'),(18,'Гарри Поттер и Кубок Огня',1,5,678,676,0,1,2003,794,13400,'18.jpg'),(19,'Текст',7,4,876,562,4,3,2017,486,3500,'19.jpg'),(20,'Метро 2033',5,25,784,1729,8,2,2021,285,10000,'20.jpg'),(21,'Очень странные дела',7,2,542,396,2,1,2019,185,12400,'21.jpg'),(22,'Кира и секрет бублика',6,8,215,289,12,0,2005,124,2000,'22.jpg'),(23,'Всё хренова',9,21,175,545,6,3,2016,231,4300,'23.jpg'),(24,'Буря мечей',15,16,200,145,11,1,2008,146,3500,'24.jpg'),(25,'Iphuck 10',12,4,164,395,3,2,2019,218,5400,'25.jpg'),(26,'Горе от ума',4,12,137,177,7,0,1994,85,7000,'26.jpg'),(27,'Волшебная гора',3,18,374,287,5,1,2005,173,3500,'27.jpg'),(28,'Коран',1,23,284,1562,8,0,1999,418,6000,'28.jpg'),(29,'Школьные приколы',14,9,216,127,1,0,2004,123,2000,'29.jpg'),(30,'Отцы и дети',12,14,679,195,3,1,2005,562,4500,'30.jpg'),(31,'На пятьдесят оттенков темнее',9,2,472,254,5,3,2009,678,3000,'31.jpg'),(32,'3000 заданий по английскому языку',6,3,489,90,4,0,2015,193,4800,'32.jpg'),(33,'Безмолвный пациент',10,2,579,380,1,2,2020,405,6700,'33.jpg'),(34,'Легкий способ выучить Java',1,4,532,781,3,1,2021,348,12000,'34.jpg'),(35,'Наука о сексе',9,6,666,784,14,3,2018,69,69000,'35.jpg'),(36,'Библия',1,4,228,997,12,0,1998,234,12000,'36.jpg'),(37,'Внутри убийцы',0,6,753,457,4,3,2007,491,4700,'37.jpg'),(38,'Гнев ангелов',6,7,256,155,3,2,1996,647,3800,'38.jpg'),(39,'Муха с татухой',2,3,637,151,7,3,2003,596,11000,'39.jpg'),(40,'Голодный дом',5,2,317,150,6,2,2015,160,5000,'40.jpg'),(41,'Лисичкин хлеб',11,8,182,126,2,0,2000,75,2500,'41.jpg'),(42,'Обратная сторона успеха',4,25,263,155,15,3,2018,152,7300,'42.jpg'),(43,'Отец',0,24,184,714,8,3,2019,998,5258,'43.jpg'),(44,'Гарри Поттер и Тайная комната',1,5,800,567,12,1,2001,642,10000,'44.jpg'),(45,'Думай и Богатей',3,9,363,269,7,2,2020,251,5000,'45.jpg'),(46,'Король и Шут',8,15,276,1159,11,1,2004,318,6000,'46.jpg'),(47,'Маленький принц',7,12,218,240,5,2,1999,253,4500,'47.jpg'),(48,'Ходячий замок',14,13,185,354,10,1,2008,158,3000,'48.jpg'),(49,'Египетский ребус',9,0,263,375,14,0,2019,83,2500,'49.jpg'),(50,'Коралина',2,20,243,446,13,0,2005,164,3240,'50.jpg'),(51,'Хроники Нарнии',12,4,186,768,1,0,2001,394,5000,'51.jpg'),(52,'Гравити Фолз',15,17,231,1540,2,0,2014,187,4700,'52.jpg'),(53,'Очаровательный кишечник',6,21,95,671,3,1,2019,263,5600,'53.jpg'),(54,'Я-женщина',1,12,174,624,4,2,1998,173,2800,'54.jpg'),(55,'Не навреди',13,10,261,527,5,2,2001,243,7400,'55.jpg'),(56,'Зачем мы спим',2,8,167,539,15,0,2009,175,7600,'56.jpg'),(57,'Будет больно',5,6,66,251,12,2,2001,55,4200,'57.jpg'),(58,'Легкий способ бросить курить',7,4,294,287,9,2,1995,371,7442,'58.jpg'),(59,'Компас питания',0,2,500,614,6,1,2006,184,1833,'59.jpg'),(60,'Как хочет женщина',12,0,317,1119,7,3,2021,94,6348,'60.jpg'),(61,'Разум убийцы',11,9,189,555,8,0,2018,186,3199,'61.jpg'),(62,'Грокаем алгоритмы',10,7,216,799,3,1,1999,278,5300,'62.jpg'),(63,'C++ для начинающих',8,5,0,561,10,3,1975,419,4700,'63.jpg'),(64,'Чистый код',4,3,1,697,8,2,2008,217,3200,'64.jpg'),(65,'Человек, который принял жену за шляпу',3,1,316,247,14,2,2000,195,1500,'65.jpg'),(66,'Akira. Том 1',5,3,654,1052,4,1,2009,346,4800,'66.jpg'),(67,'Наруто. Книга 1',4,6,865,718,5,2,2006,678,6700,'67.jpg'),(68,'Берсерк. Том 1',1,3,53,912,12,3,1997,456,4700,'68.jpg'),(69,'Атака на титанов. Книга 1',3,4,467,614,15,2,2013,849,2800,'69.jpg'),(70,'Токийский Гуль. Издание ZXC',9,8,246,664,6,2,2007,993,10000,'70.jpg'),(71,'Русский в Англии',3,9,503,692,0,0,2014,256,3400,'71.jpg'),(72,'Путеводитель по Амонг Ас',5,4,356,319,4,3,2021,228,3700,'72.jpg'),(73,'Следуй за ритмом',14,0,556,387,3,1,2003,245,11600,'73.jpg'),(74,'Неизвестная Россия',0,3,253,984,7,2,1998,936,7900,'74.jpg'),(75,'Высшая точка чувств',5,9,462,431,7,2,2005,436,7000,'75.jpg'),(76,'Последний дом на Никчемной улице',2,5,736,487,4,1,2009,478,4500,'76.jpg'),(77,'Не бойся. Как уйти от негативного сценария в жизни',7,10,546,413,4,2,1999,235,5000,'77.jpg'),(78,'Генри Смарт, пицца и магические сокровища',4,3,533,423,1,2,2000,536,7000,'78.jpg'),(79,'Страна чудесь Коктебель',2,7,482,654,0,3,2020,346,9000,'79.jpg'),(80,'Паучья корона',3,15,379,412,6,1,2019,458,4900,'80.jpg'),(81,'Безумная Харли Квинн',2,5,325,1697,2,3,2012,482,7000,'81.jpg'),(82,'Двойное экспресо',3,7,64,584,4,2,2003,543,7200,'82.jpg'),(83,'Как ты умрешь',8,4,472,555,6,3,2002,135,6000,'83.jpg'),(84,'Повелитель войн',2,8,234,494,2,1,2007,646,8900,'84.jpg'),(85,'Принц из серебра и золота',3,4,347,532,7,2,2002,432,5300,'85.jpg'),(86,'Магия',4,11,164,555,1,3,1999,63,1000,'86.jpg'),(87,'Хохот Шамана',6,25,196,446,10,3,1985,95,4300,'87.jpg'),(88,'Классическое таро Уэйта',9,16,216,377,12,2,2008,188,2600,'88.jpg'),(89,'Сила настоящего',5,23,317,247,13,0,2014,281,1877,'89.jpg'),(90,'Беседы с Богом',12,27,143,271,14,1,2021,167,1955,'90.jpg'),(91,'Восстание масс',11,13,66,294,0,2,1999,143,1888,'91.jpg'),(92,'Будда',14,15,143,683,3,3,2003,271,2007,'92.jpg'),(93,'Общество потребления',12,19,185,153,6,3,2019,310,3100,'93.jpg'),(94,'Иметь или быть',0,25,199,1064,9,1,1954,185,4500,'94.jpg'),(95,'Котологика',3,11,261,219,2,0,2001,215,7100,'95.jpg'),(96,'Критика чистого разума',2,10,164,154,1,1,2007,310,6199,'96.jpg'),(97,'Сумма технологии',4,13,842,281,5,2,1985,194,4200,'97.jpg'),(98,'Как быть стоиком',9,17,274,814,9,3,1988,73,1777,'98.jpg'),(99,'Анти-Дюринг',7,24,84,429,10,1,1975,217,2300,'99.jpg'),(100,'Государь',6,23,185,536,11,0,2007,521,1500,'100.jpg'),(101,'Дом, в котором..',1,8,10,614,13,3,2005,315,1000,'101.jpg'),(102,'Мартин Иден',11,0,215,316,2,2,2020,175,500,'102.jpg'),(103,'Повелитель мух',14,4,75,55,0,1,2021,412,5212,'103.jpg'),(104,'В конце они оба умрут',9,11,1,175,1,3,2001,281,7811,'104.jpg'),(105,'Девочка в нулевой степени',10,25,100,1965,6,0,1977,163,9000,'105.jpg'),(106,'Empire V',2,26,463,248,4,3,1955,385,4466,'106.jpg'),(107,'Поместье Лейкседж',3,21,536,573,4,1,2008,463,5677,'107.jpg'),(108,'Ночь, когда я встретил Рождественского Деда',2,12,873,539,7,2,2007,863,4878,'108.jpg'),(109,'Дохулиарды. Не тратить меньше, а зарабатывать больше',6,4,673,413,4,3,2003,893,2456,'109.jpg'),(110,'Дочь торговца шелком',4,7,27,371,8,1,2019,236,5865,'110.jpg'),(111,'Мой лучший друг - желудок: еда для умных людей',8,4,36,367,5,0,2021,683,7589,'111.jpg'),(112,'Бортпроводница',3,8,273,424,6,3,2008,985,6878,'112.jpg'),(113,'Кикимора из фитнес-центра',9,24,471,282,2,1,2009,986,9708,'113.jpg'),(114,'Феминизм: наглядно. Большая книга о женской революции',2,9,584,517,15,2,2002,479,5688,'114.jpg'),(115,'Утраченный символ',10,4,746,574,3,3,1999,548,4647,'115.jpg'),(116,'Очень страшная книга квестов',1,1,654,584,7,0,1990,228,2674,'116.jpg'),(117,'Мочевой пузырь. Все, что нужно знать о мочевыделительной ',3,14,578,319,3,1,1998,348,3563,'117.jpg'),(118,'Тени теней',6,3,572,507,7,2,2002,337,3677,'118.jpg'),(119,'Мгновенная карма',9,7,672,433,2,3,2021,358,9346,'119.jpg'),(120,'О чем пьют ветеринары',3,25,831,573,7,0,2017,432,9303,'120.jpg'),(121,'Почему мама снова на веселе',8,3,644,584,1,1,2019,655,4637,'121.jpg'),(122,'Бутербродный вор (выпуск 3)',7,9,256,286,5,2,2008,685,8583,'122.jpg'),(123,'Место преступления - тело',2,3,272,504,3,3,2004,236,4373,'123.jpg'),(124,'Кипиай',8,6,552,459,7,1,2009,436,3676,'124.jpg'),(125,'Однажды я выберу тебя',3,8,617,527,4,2,2006,477,10486,'125.jpg');
/*!40000 ALTER TABLE `books` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2021-11-09 13:03:30
